#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mgoogle_storage_bucket.resume_bucket: Refreshing state... [id=resume_bucket02934502349][0m
[0m[1mgoogle_service_account.tf-sa: Refreshing state... [id=projects/cloud-resume-challenge-361611/serviceAccounts/terraform-service-account@cloud-resume-challenge-361611.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_service.enabled_apis["dns.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/dns.googleapis.com][0m
[0m[1mgoogle_project_service.enabled_apis["cloudbuild.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/cloudbuild.googleapis.com][0m
[0m[1mgoogle_project_service.enabled_apis["iam.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/iam.googleapis.com][0m
[0m[1mgoogle_project_service.enabled_apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/cloudresourcemanager.googleapis.com][0m
[0m[1mgoogle_project_service.enabled_apis["run.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/run.googleapis.com][0m
[0m[1mgoogle_project_service.enabled_apis["serviceusage.googleapis.com"]: Refreshing state... [id=cloud-resume-challenge-361611/serviceusage.googleapis.com][0m
[0m[1mgoogle_service_account_key.sa_key: Refreshing state... [id=projects/cloud-resume-challenge-361611/serviceAccounts/terraform-service-account@cloud-resume-challenge-361611.iam.gserviceaccount.com/keys/f7499d28ed355d26be2af06f1f0c893d3e366500][0m
[0m[1mgoogle_project_iam_member.tf-sa-binding["roles/owner"]: Refreshing state... [id=cloud-resume-challenge-361611/roles/owner/serviceAccount:terraform-service-account@cloud-resume-challenge-361611.iam.gserviceaccount.com][0m
[0m[1mgoogle_project_iam_member.tf-sa-binding["roles/storage.admin"]: Refreshing state... [id=cloud-resume-challenge-361611/roles/storage.admin/serviceAccount:terraform-service-account@cloud-resume-challenge-361611.iam.gserviceaccount.com][0m
[0m[1mgoogle_storage_default_object_access_control.website_read: Refreshing state... [id=resume_bucket02934502349/allUsers][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
 [36m<=[0m read (data resources)
[0m
Terraform will perform the following actions:

[1m  # data.google_dns_managed_zone.resume_dns_zone[0m will be read during apply[0m
  # (depends on a resource or a module with changes pending)[0m
[0m [36m<=[0m[0m data "google_dns_managed_zone" "resume_dns_zone" {
      [32m+[0m [0m[1m[0mdescription[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mdns_name[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_zone_id[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m            = "resume_dns_zone"
      [32m+[0m [0m[1m[0mname_servers[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mvisibility[0m[0m      = (known after apply)
    }

[1m  # google_compute_backend_bucket.website[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_backend_bucket" "website" {
      [32m+[0m [0m[1m[0mbucket_name[0m[0m        = "resume_bucket02934502349"
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m        = "Contains files needed by the website"
      [32m+[0m [0m[1m[0menable_cdn[0m[0m         = true
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "website-backend"
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)

      [32m+[0m [0mcdn_policy {
          [32m+[0m [0m[1m[0mcache_mode[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mclient_ttl[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mdefault_ttl[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mmax_ttl[0m[0m                      = (known after apply)
          [32m+[0m [0m[1m[0mnegative_caching[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mrequest_coalescing[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mserve_while_stale[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msigned_url_cache_max_age_sec[0m[0m = (known after apply)

          [32m+[0m [0mbypass_cache_on_request_headers {
              [32m+[0m [0m[1m[0mheader_name[0m[0m = (known after apply)
            }

          [32m+[0m [0mcache_key_policy {
              [32m+[0m [0m[1m[0minclude_http_headers[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mquery_string_whitelist[0m[0m = (known after apply)
            }

          [32m+[0m [0mnegative_caching_policy {
              [32m+[0m [0m[1m[0mcode[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mttl[0m[0m  = (known after apply)
            }
        }
    }

[1m  # google_compute_global_address.website[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_global_address" "website" {
      [32m+[0m [0m[1m[0maddress[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "website-lb-ip"
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
    }

[1m  # google_compute_global_forwarding_rule.default[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_global_forwarding_rule" "default" {
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mip_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mip_protocol[0m[0m           = "TCP"
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mload_balancing_scheme[0m[0m = "EXTERNAL"
      [32m+[0m [0m[1m[0mname[0m[0m                  = "website-forwarding-rule"
      [32m+[0m [0m[1m[0mnetwork[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mport_range[0m[0m            = "443"
      [32m+[0m [0m[1m[0mproject[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mpsc_connection_id[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mpsc_connection_status[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mtarget[0m[0m                = (known after apply)
    }

[1m  # google_compute_managed_ssl_certificate.website[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_managed_ssl_certificate" "website" {
      [32m+[0m [0m[1m[0mcertificate_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mexpire_time[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                      = "website-cert"
      [32m+[0m [0m[1m[0mproject[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0msubject_alternative_names[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m                      = "MANAGED"

      [32m+[0m [0mmanaged {
          [32m+[0m [0m[1m[0mdomains[0m[0m = (known after apply)
        }
    }

[1m  # google_compute_target_https_proxy.website[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_target_https_proxy" "website" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "website-target-proxy"
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mproxy_bind[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproxy_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mquic_override[0m[0m      = "NONE"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mssl_certificates[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0murl_map[0m[0m            = (known after apply)
    }

[1m  # google_compute_url_map.website[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_url_map" "website" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdefault_service[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mmap_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "website-url-map"
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
    }

[1m  # google_dns_record_set.website[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_dns_record_set" "website" {
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_zone[0m[0m = "resume_dns_zone"
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mrrdatas[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mttl[0m[0m          = 300
      [32m+[0m [0m[1m[0mtype[0m[0m         = "A"
    }

[1m  # google_project_service.enabled_apis["compute.googleapis.com"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_project_service" "enabled_apis" {
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = "cloud-resume-challenge-361611"
      [32m+[0m [0m[1m[0mservice[0m[0m            = "compute.googleapis.com"
    }

[0m[1mPlan:[0m 8 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @jamesfricker, Action: `pull_request`, Working Directory: ``, Workflow: `deployment`*